espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/pvt_struct.h
/** Type of comb_pd_site3_unit1_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site3_unit1 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site3_unit1:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site3_unit1 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site3_unit1:1;
        /** timing_err_cnt_o_vt0_pd_site3_unit1 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site3_unit1:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit1_vt0_conf2_reg_t;

/** Type of comb_pd_site3_unit2_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site3_unit2 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site3_unit2:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site3_unit2 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site3_unit2:1;
        /** timing_err_cnt_o_vt0_pd_site3_unit2 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site3_unit2:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit2_vt0_conf2_reg_t;

/** Type of comb_pd_site3_unit3_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site3_unit3 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site3_unit3:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site3_unit3 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site3_unit3:1;
        /** timing_err_cnt_o_vt0_pd_site3_unit3 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site3_unit3:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit3_vt0_conf2_reg_t;

/** Type of comb_pd_site3_unit0_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site3_unit0 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site3_unit0:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site3_unit0 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site3_unit0:1;
        /** timing_err_cnt_o_vt1_pd_site3_unit0 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site3_unit0:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit0_vt1_conf2_reg_t;

/** Type of comb_pd_site3_unit1_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site3_unit1 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site3_unit1:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site3_unit1 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site3_unit1:1;
        /** timing_err_cnt_o_vt1_pd_site3_unit1 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site3_unit1:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit1_vt1_conf2_reg_t;

/** Type of comb_pd_site3_unit2_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site3_unit2 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site3_unit2:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site3_unit2 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site3_unit2:1;
        /** timing_err_cnt_o_vt1_pd_site3_unit2 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site3_unit2:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit2_vt1_conf2_reg_t;

/** Type of comb_pd_site3_unit3_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site3_unit3 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site3_unit3:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site3_unit3 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site3_unit3:1;
        /** timing_err_cnt_o_vt1_pd_site3_unit3 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site3_unit3:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit3_vt1_conf2_reg_t;

/** Type of comb_pd_site3_unit0_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site3_unit0 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site3_unit0:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site3_unit0 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site3_unit0:1;
        /** timing_err_cnt_o_vt2_pd_site3_unit0 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site3_unit0:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit0_vt2_conf2_reg_t;

/** Type of comb_pd_site3_unit1_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site3_unit1 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site3_unit1:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site3_unit1 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site3_unit1:1;
        /** timing_err_cnt_o_vt2_pd_site3_unit1 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site3_unit1:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit1_vt2_conf2_reg_t;

/** Type of comb_pd_site3_unit2_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site3_unit2 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site3_unit2:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site3_unit2 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site3_unit2:1;
        /** timing_err_cnt_o_vt2_pd_site3_unit2 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site3_unit2:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit2_vt2_conf2_reg_t;

/** Type of comb_pd_site3_unit3_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site3_unit3 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site3_unit3:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site3_unit3 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site3_unit3:1;
        /** timing_err_cnt_o_vt2_pd_site3_unit3 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site3_unit3:16;
    };
    uint32_t val;
} pvt_comb_pd_site3_unit3_vt2_conf2_reg_t;

/** Type of value_update register
 *  needs field desc
 */
typedef union {
    struct {
        /** value_update : WT; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t value_update:1;
        /** value_update_bypass : R/W; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t value_update_bypass:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} pvt_value_update_reg_t;


/** Group: version register */
/** Type of date register
 *  version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 34677040;
         *  version register
         */
        uint32_t date:32;
    };
    uint32_t val;
} pvt_date_reg_t;


